In [4]:
import pandas as pd
import numpy as np

import pandas and numpy as spesific variables instead of calling specific functions inside them

Read excel file as dataframe to perform analysis over it as table (columns and indexes or rows)

In [5]:
df=pd.read_csv('C:/Users/NoranYousef/Downloads/titanic dataset.csv')

In [2]:
#  after viewing titanic dataset and search for all fields 
# #PassengerId--> id for every passenger
# #Survived--> Who lived after the ship sank
# Pclass-->passenger ticket class
# SibSp--> if passenger married and his partnier on the ship or not
# Parch-->number of children for every married passenger
# Ticket,Fare-->Ticket number,and how much the passenger paied for his ticket
# Cabin,Embarked-->cabin number,The port from which the passenger boarded

To discover the contient of dataset we view first five rows from it using head() function we found that there is columns contains nan values and we have missing data like cabin column and we have 12 columns

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

To discover the contient of last five rows from dataset we use tail() function and we found that there is also missing data at Age column

In [6]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

By using info() function we view details of dataset so here we found that there is total 12 columns feom 0 to 11,891 rows,and we found that Age has 177  , cabin has 687 and embarked has 2 missed vlaues ,we also determine all datatypes for all columns

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

We found that titanic has 891 entries and 12 columns

In [10]:
df.shape

(891, 12)

By using describe we found that the data is not normalized at all because 25% value is larger than min value with big difference and The data is more inclined to the maximam value,but mean is Accurate 
because it has the same value as 50%

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Find names of all passengers and we found that there is a married ,single womens and mens on the ship and we can discover names of hasbends for any married womens by thier names

In [9]:
names=df['Name']
names

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

Here after locating 'PassengerId','Name','Sex' columns we found that we have femals(married,single) and males on the ship

In [16]:
df.loc[:,['PassengerId','Name','Sex']]

     PassengerId                                               Name     Sex
0              1                            Braund, Mr. Owen Harris    male
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2              3                             Heikkinen, Miss. Laina  female
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4              5                           Allen, Mr. William Henry    male
..           ...                                                ...     ...
886          887                              Montvila, Rev. Juozas    male
887          888                       Graham, Miss. Margaret Edith  female
888          889           Johnston, Miss. Catherine Helen "Carrie"  female
889          890                              Behr, Mr. Karl Howell    male
890          891                                Dooley, Mr. Patrick    male

[891 rows x 3 columns]

After chosing a random sample of data we لbecame sure that cabin columns has alot of missing data scattered around dataset and donot have specific pattern

In [9]:
df.loc[6:9,'Ticket':'Embarked']

   Ticket     Fare Cabin Embarked
6   17463  51.8625   E46        S
7  349909  21.0750   NaN        S
8  347742  11.1333   NaN        S
9  237736  30.0708   NaN        C

In [10]:
df.iloc[1:10][['Parch','Ticket','Cabin']]

   Parch            Ticket Cabin
1      0          PC 17599   C85
2      0  STON/O2. 3101282   NaN
3      0            113803  C123
4      0            373450   NaN
5      0            330877   NaN
6      0             17463   E46
7      1            349909   NaN
8      2            347742   NaN
9      0            237736   NaN

Here we discovered name of Older passenger

In [11]:
df.loc[df['Age'].idxmax()][3]

'Barkworth, Mr. Algernon Henry Wilson'

Here we discovered name of dead males with age larger than 27 for insurance

In [22]:
df[(df['Survived']==1)&(df['Sex']=='male')&(df['Age']>27)] ['Name']

21                             Beesley, Mr. Lawrence
23                      Sloper, Mr. William Thompson
74                                     Bing, Mr. Lee
81                       Sheerlinck, Mr. Jan Baptist
187    Romaine, Mr. Charles Hallace ("Mr C Rolmane")
209                                 Blank, Mr. Henry
224                     Hoyt, Mr. Frederick Maxfield
248                    Beckwith, Mr. Richard Leonard
286                          de Mulder, Mr. Theodore
288                             Hosono, Mr. Masabumi
338                            Dahl, Mr. Karl Edwart
390                       Carter, Mr. William Ernest
400                               Niskanen, Mr. Juha
414                        Sundman, Mr. Johan Julian
429               Pickard, Mr. Berk (Berk Trembisky)
430        Bjornstrom-Steffansson, Mr. Mauritz Hakan
447                      Seward, Mr. Frederic Kimber
449                   Peuchen, Major. Arthur Godfrey
453                         Goldenberg, Mr. Samuel L
455                               Jalsevac, Mr. Ivan
460                              Anderson, Mr. Harry
510                         Daly, Mr. Eugene Patrick
512                        McGough, Mr. James Robert
543                                Beane, Mr. Edward
569                                Jonsson, Mr. Carl
570                               Harris, Mr. George
572                 Flynn, Mr. John Irwin ("Irving")
579                              Jussila, Mr. Eiriik
587                 Frolicher-Stehli, Mr. Maxmillian
599     Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")
604                  Homer, Mr. Harry ("Mr E Haven")
621                     Kimball, Mr. Edwin Nelson Jr
630             Barkworth, Mr. Algernon Henry Wilson
632                        Stahelin-Maeglin, Dr. Max
645                        Harper, Mr. Henry Sleeper
647              Simonius-Blumer, Col. Oberst Alfons
660                    Frauenthal, Dr. Henry William
673                            Wilhelms, Mr. Charles
679               Cardeza, Mr. Thomas Drake Martinez
690                          Dick, Mr. Albert Adrian
701                 Silverthorne, Mr. Spencer Victor
707                Calderhead, Mr. Edward Pennington
712                         Taylor, Mr. Elmer Zebley
737                           Lesurer, Mr. Gustave J
744                               Stranden, Mr. Juho
838                                  Chip, Mr. Chang
857                           Daly, Mr. Peter Denis
Name: Name, dtype: object

Age mean of Survived people is 30 which mean vast majority of survivors are young

In [11]:
df[(df['Survived']==0)]['Age'].mean()

30.62617924528302

Age median of Survived people Confirm the same information which is 28

In [27]:
df[(df['Survived']==1)]['Age'].median()

28.0

We found by using unique() function with Embarked we found port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [14]:
Embarked_col=df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

We found that number of dead people that thier port is Cherbourg and females that they were on the ship is 64

In [37]:
S=df[(df['Survived']==1)&(df['Embarked']=='C')&(df['Sex']=='female')]
(S['Pclass']>0).value_counts()

True    64
Name: Pclass, dtype: int64

We found number of mens that they were on the ship is 647 by apply function

In [54]:
df['Name'].apply(lambda str:('Mr' in str)).sum()

647

We found number of single womens that they were on the ship is 182 by apply function

In [55]:
df['Name'].apply(lambda str:('Miss' in str)).sum()

182

In [ ]:
# we groubed entries by passengerClass and survived or not 
#     and we found:- 
#     class 1 and dead people thier count is 80
#     class 1 and Survived people thier count is 136
#     class 2 and dead people thier count is 97
#     class 2 and Survived people thier count is 87
#     class 3 and dead people thier count is 372
#     class 3 and Survived people thier count is 119

In [ ]:
S2=df.groupby('Pclass')['Survived'].value_counts()

In [ ]:
#we groubed entries by passengerClass and thier ages 
#     and we found:- 
#  mean of ages for class 1 passengers is 38
#  mean of ages for class 2 passengers is 29
#  mean of ages for class 3 passengers is 25

In [83]:
S3=df.groupby('Pclass')['Age'].mean()
S3

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [ ]:
#we groubed entries by Embarked and thier Fare
#     and we found:- 
#  min fare for passengers ride from  Southampton port is 0 for free
#  min fare for passengers ride from  Cherbourg port is  4.0125
#  min fare for passengers ride from  Queenstown port is  6.7500 then we sort results for better presentation

In [112]:
S4=df.groupby('Embarked')['Fare'].agg(np.min).sort_values()
S4

Embarked
S    0.0000
C    4.0125
Q    6.7500
Name: Fare, dtype: float64

We sorted passengers by thier age  then we groubed them by thier sex and found the head

In [113]:
df.sort_values(by='Age',ascending=False).groupby('Sex').head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
268,269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,S

In [131]:
 df['mean']=0
 df['Count']=0
 df['Count1']=0

we found that mean of dead people is 0 and thier count 549
and we found that mean of servived people is 0 and thier count 342

In [129]:
df.groupby('Survived').agg({'mean': 'mean','Count':'count'})

          mean  Count
Survived
0          0.0    549
1          0.0    342

We set multi index PassengerId,Pclass for dataframe and sort data acording to them

In [140]:
df1=df.set_index(['PassengerId','Pclass'])
df1=df1.sort_index()

In [ ]:
# we grouped dataframe by level='Pclass' with thier fare and find max fare for each class 
# so we noticed that class 1 max fare is 512.3292
# so we noticed that class 2 max fare is 73.5000
# so we noticed that class 3 max fare is 69.5500

In [141]:
df1.groupby(level=1)['Fare'].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

We used IndexSlice dor better and easier indexing with level1 and level2
and we displayed passengerId from 1 to 20 and Pclass from 1 to 2 with all columns

In [155]:
Idx=pd.IndexSlice

df1.loc[Idx[1:20,1:2],:]

,,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,B,C,mean,Count,Count1
PassengerId,Pclass,,,,,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0,0,0,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0,0,0,0
7,1,0,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0,0,0,0,0
10,2,1,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,0,0,0,0,0
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,0,0,0,0,0
16,2,1,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,0,0,0,0,0
18,2,1,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,0,0,0,0,0